{"data":"Join   Log In        AngelList   Syndicates  Startups  Funds  Startup Jobs  Recruiting  More ?     StartupsPeople MarketsLocations SalariesValuations Incubators                                      Jennifer Lum   Cofounder @Adelphic, Investor, Advisor.           Angel    Toronto      Website           There was a problem loading your content.                   Jennifer Lum      104 Following                Investments                  Experience             Adelphic   Founder   Adelphic is a leading mobile demand side platform             Apple   Employee         Founder  Adelphic,  Apricot Capital    Employee  Apple,  Quattro Wireless,  Apricot Capital,  HP,  m-Qube,  VeriSign,  WebHosting.com,  Compaq    Investor       Syndicator       Incubator       Advisor  Burstly,  Tablelist,  Appsembler,  Mavrck,  Finalta,  Women Innovate Mobile (WIM) Accelerator,  JOLT Accelerator,  Covvet,  Blokable    Attorney       Board Member       Mentor  Techstars,  500 Startups,  HIGHLINE    Member       Acquired       Customer                About            What I Do       I like to add value by working closely with entrepreneurs and leveraging my experience and network.  I'm working on my fourth startup, Adelphic. The three earlier startups each exited for over $250M.  I am an EIR at MIT and a mentor at 500 Startups and Techstars.    Describe what you have done, what you are doing, and the kinds of things you are interested in.          Locations       Boston San Francisco New York City Los Angeles Silicon Valley Toronto          Markets       Mobile Mobile Advertising Mobile Commerce Analytics Digital Media Big Data Advertising Media Enterprise Software Software Wireless Real Time Messaging Financial Exchanges Bridging Online and Offline Small and Medium Businesses Education Health Care Information Technology Location Based Services                               We're hiring · Help Twitter Facebook · Terms Risks  · Mobile    · Desktop   ·  Profile not verified","name":"doc22.json","id":22,"outgoingLinks":81,"title":"Jennifer Lum - AngelList","url":"https://angel.co/jenniferlum"}