{"data":"Join   Log In    AngelList          Seattle Startup Jobs 17,488 of the world's best startups are hiring on AngelList  Find a job          Apply privately  Only companies you apply to will see you're looking for a job. Your current boss won't know.       See salary up-front  See salary and equity before you apply.  Compare jobs using our startup salary tool.       No Middlemen  Speak directly to the startup's founders.  No recruiters allowed.               Beam Live Streaming      UI Designer / Senior Frontend Engineer $80k - $100k · 0.1 - 0.75%  Beam is one of the fastest growing live-video platforms for gamers. We serve millions of stream views each month, and our web frontend is in the critical path for over 70% of those views!  You'll work on a small team of passionate developers... Full Time · Seattle · Front-End Development · Video Engineering · AngularJS · Material Design        Mona The world's smartest personal shopping assistant (Techstars NYC '15)      Front-End & iOS Software Engineer $60k - $110k · 0.2 - 1.0%  We are looking for a software engineer to join our team in NYC or Seattle. A degree in Computer Science or related field is a must. You are highly analytical, comfortable with devising, implementing and troubleshooting front-end technologies.... Full Time · Seattle · Remote OK        Techstars A global ecosystem that empowers entrepreneurs to bring new technologies to market.      Full-Stack Software Engineer $70k - $100k · 0.0 - 1.0%  Please apply here! http://grnh.se/phfca8  This is a role for the Seattle, WA office. We are currently only accepting candidates qualified to work in the United States. Role is Full-Time.  You are a full-stack software engineer who loves working... Full Time · Seattle · MongoDB · Backbone.js · API · Ruby on Rails        PaperG Making it easy to build, tailor, and test ads.      Senior Software Engineer - Site Reliability $60k - $140k · 0.05 - 0.2%  WHY IS SITE RELIABILITY ENGINEERING IMPORTANT TO PAPERG?  Site reliability engineers (SREs) are responsible for the overall reliability of PaperG infrastructure and products. SREs design and implement the tools that automate building reliable... Full Time · Seattle    Senior Software Engineer - Data $90k - $150k · 0.01 - 0.2%  Do you enjoy writing web services and crunching data? Is building a data visualization system that handles billions of events something that excites you? Do you want to work on a precision measurement instrument that backs the advertisements for... Full Time · Seattle    Senior Front-End Engineer $80k - $140k · 0.01 - 0.05%  WHY IS FRONT-END ENGINEERING IMPORTANT TO PAPERG?  PaperG has built the very first Creative Management Platform. We often push the limits of what can be done in a browser. We have wowed some of our biggest clients with the technology that we have... Full Time · Seattle        Spare5 Intelligent Crowdsourcing      Software Engineer, Mobile $85k - $140k · 0.0 - 0.4%  Spare5 is seeking an ambitious and experienced mobile developer to join our engineering team, working on our Android and iOS apps. You will collaborate closely with management, other engineers, and designers to develop new experiences within the... Full Time · Seattle    Lead UX Designer $100k - $150k · 0.1 - 0.5%  Spare5 seeks a curious, creative, and courageous Lead UX Designer. As our company has grown, so has the surface area of the challenges we need for design to directly tackle and help lead the team through. This leadership role calls for brisk... Full Time · Seattle · Rapid Prototyping · HTML5 & CSS3        Outreach Sales Automation Platform      Full-Stack Engineer $90k - $140k · 0.05 - 0.2%  We are looking for a hungry and talented front-end focused, full-stack developer to join the Outreach engineering team. You’ll work with our Application team to build features that solve big problems for both our customers and our own internal... Full Time · Seattle    DevOps Engineer $90k - $140k · 0.05 - 0.2%  Are you curious by nature? Do you enjoy working with cutting edge infrastructure and development tools? Outreach is looking for a talented DevOps engineer to join the Infrastructure Engineering team and help us scale our platform. The ideal... Full Time · Seattle    Product Expert $40k - $50k · No equity  At Outreach, we build communication software that helps enterprise sales reps communicate more effectively and efficiently with the world. We are now over 50 employees, with over 1,000 paying customers (including the likes of Adroll, CenturyLink,... Full Time · Seattle        Curalate The leading visual commerce platform, enabling brands to unlock the power of pictures.      Full Stack Software Engineer, Curalate SEATTLE $80k - $130k · 0.001 - 0.5%  Curalate is looking for talented software developers to join our team.  Our engineering team today is deep in the trenches -- tackling some of the gnarliest problems out there at the intersection of computer vision and big data -- and we're... Full Time · Seattle · C++ · Java · Javascript · C#    DevOps Engineer Based in SEATTLE $80k - $130k · 0.0 - 0.05%  Curalate is looking for talented DevOps engineers to join our team.  Our tech team is deep in the trenches -- tackling some of the gnarliest problems out there at the intersection of computer vision and big data -- and we're looking for a few... Full Time · Seattle · Javascript · MySQL · MongoDB · Cloud Services    Product Manager $70k - $130k · 0.001 - 0.05%  Curalate is looking for a passionate and experienced product manager to join our team.  Over the past two and a half years, we've established a reputation as thought leaders around the visual web and innovators around socially-powered... Full Time · Seattle        ReadyPulse Inspirational Marketing for Aspirational Brands      Senior Software Engineer (Backend) $120k - $125k · 0.5 - 1.0%   Full Time · Seattle · Java · Hadoop · Big Data · Distributed Systems    Software Engineer (Mobile) (iOS) $120k - $125k · 0.5 - 1.0%  ReadyPulse helps brands provide social proof on demand and at scale by helping them obtain high quality, product relevant, and authorized content from their top ambassadors.  We are looking for self motivated engineers with strong experience... Full Time · Seattle        Baker Loyalty and rewards for cannabis customers      Territory Sales Manager - Seattle $50k - $120k · 0.0 - 0.25%  Territory Manager (Seattle)  We are seeking a Territory Manager in Seattle to join our growing team. The position will report to the VP, Sales located in Denver, CO.   Position Summary:   The primary responsibility is to close new retail... Full Time · Seattle · Business Development · Sales · Sales Strategy and Management · Sales and Marketing        Crema.co The coffee marketplace      Software Engineer $75k - $125k · 0.5 - 2.5%  Love coffee? If you're a well-rounded Rails developer in Seattle looking to join an exciting startup, then this could be the opportunity for you.  Crema.co is the coffee marketplace. We give consumers easy access to roasted-to-order coffees... Full Time · Seattle        Skilljar Customer training made simple      Account Executive $50k - $120k · 0.05 - 0.25%  Skilljar is seeking multiple Account Executives to join our fast-growing team. These individuals will be responsible for rapidly building prospect lists, qualifying leads, engaging decision-makers, and closing clients.  We’re looking for team... Full Time · Seattle · Sales · Sales and Marketing    Web Developer $75k - $125k · 0.1 - 0.5%  Skilljar is seeking a versatile Web Developer to join our fast-growing team. This person will be responsible for the front-end design and development of Skilljar's online training platform, content management dashboard, and our marketing... Full Time · Seattle · Python · Javascript · HTML · CSS    Software Development Engineer $75k - $125k · 0.1 - 0.5%  Skilljar is seeking a versatile Software Development Engineer to join our fast-growing team. This person will be responsible for the technical design, development, and deployment of amazing products that delight our customers.  We’re looking for... Full Time · Seattle        TalentHound Fetching Jobs for Talent. Discover, Match, Hire      Senior iOS Engineer $40k - $60k · 1.0 - 3.0%  Talent hound is looking for experienced iOS engineers to join our engineering team and help innovate the current app.  -Write code that will be used by millions and be recognized by the most discerning app reviewers out there: Apple.  Work closely... Full Time · Seattle · Remote OK · iOS · iOS Development        AreaMetrics AreaMetrics personalizes the world around you by leveraging sensors and data.      Senior Back-End Software Engineer $90k - $115k · 0.5 - 1.5%  The AreaMetrics SDKs are currently being used by many large apps, and our platform is seeing millions of transactions per day.  AreaMerics is looking for a back-end engineer who can lead our efforts to design and support systems that can scale and... Full Time · Seattle    Junior Front-End Software Engineer $65k - $90k · 0.01 - 0.5%  Our platform is seeing millions of transactions per day, and we’re looking for a motivated front-end engineer who can help us create our customer-facing products.  Our front-end engineers are responsible for the development and maintenance of core... Full Time · Seattle    iOS SDK Engineer $90k - $115k · 0.5 - 1.5%  The AreaMetrics SDKs are currently being used by many large apps, and our platform is seeing millions of transactions per day.  We’re looking for a motivated engineer that can help us build our iOS SDK, one of our core products. As we develop new... Full Time · Seattle        Jova Salesforce for non-desk workers (Techstars Seattle)      Web Developer $80k - $130k · 0.25 - 1.0%  The Job:  As the Web Developer, you will be responsible for developing and maintaining front-end web applications for our enterprise solution. Collaborate seamlessly with end users, engineers, UX designers and business team through the entire... Full Time · Seattle    Mobile Developer $80k - $130k · 0.25 - 1.0%  As a member of the technical team, you will own and drive the development and testing of Jova's API's and mobile experiences, as well as expand on existing server-side architecture. As development progresses, you will have the... Full Time · Seattle    Customer Success Specialist $40k - $60k · 0.0 - 1.0%  As a member of the Customer Success team, you'll play an essential role in actively managing and developing a portfolio of service companies. You will often be the first touch-point with customers. Your ability to develop strong... Full Time · Seattle        Apptentive We help companies communicate better with their mobile customers.      Senior Web Engineer $85k - $120k · 0.1 - 0.25%   Full Time · Seattle · Javascript · CSS · Hadoop · MongoDB        Tred Sell your car for more      Software Engineer $70k - $120k · 0.125 - 0.25%  We're looking for a software engineer with 2+ years of JavaScript experience. You should be versatile and ready to multitask, since you’ll be working closely with our operations team to identify areas for improvement across web and app... Full Time · Seattle · Javascript · Node.js · React.js    Sales and Support Associate $36k - $80k · 0.125 - 0.25%  We are a venture-backed startup that is revolutionizing the way that people buy and sell cars by replacing the brick and mortar dealership with a peer to peer marketplace. We’re looking for people who are passionate about delivering awesome... Full Time · Seattle · Salesforce · Phone Skills · Asana · Intercom.Io        FastBar High-speed payments for events      VP of Engineering $0k - $80k · 3.0 - 10.0%  Are you a rock star technologist looking to join an early stage startup at the intersection of payments, events and wearable technology? Are you looking to get involved in a company where you can not only can dive deep and crank out code across a... Cofounder · Seattle · Software Engineering · Objective C · C# · Android    Senior Full Stack .NET Engineer $40k - $80k · 0.1 - 2.0%  Are you a rock star engineer looking to join an early stage startup at the intersection of payments, events and wearable technology? Are you looking to get involved in a company where you dive deep and crank out code across the entire stack in a... Full Time · Seattle · Objective C · Mobile Application Design · C# · Android    Senior Mobile Application Engineer $40k - $80k · 0.1 - 2.0%  Are you a rock star engineer looking to join an early stage startup at the intersection of payments, events and wearable technology? Are you looking to get involved in a company where you dive deep and crank out code across the entire stack in a... Full Time · Seattle · Android · iOS Development · Mobile Application Development · Xamarin        StreamLine      Software Engineer $60k - $90k · 0.0 - 1.0%  Streamline is revolutionizing the way retailers expand. We are developing a highly analytical, data-driven platform that identifies the unique success factors for a business and uses these insights to advise clients on where and how to grow their... Full Time · Seattle        Niantic Adventures on foot with others      Unity Game Developer $80k - $140k · 0.05 - 0.25%  Create mobile real-world MMO experiences using Unity 3D. You will work on creating both compelling games in Unity as well as high-performance, well-designed C# code to enable many more developers to create compelling experiences on our platform.... Full Time · Seattle · C# · Unity3D · Unity 3D    Mobile Software Engineer (Java) $90k - $150k · 0.05 - 0.25%  Create mobile real-world MMO experiences on Android and iOS, with a particular emphasis on development in Java. You will work on making Ingress, our game downloaded more than 12 million times and played around the world, even better and more... Full Time · Seattle · Java · Android · iOS Development · Mobile Application Development    Software Engineer - Server Infrastructure $100k - $160k · 0.05 - 0.25%  Create the server infrastructure to support mobile real-world MMO experiences using Java and Google AppEngine. You will work on both creating scalable, high-performance gameplay servers on AppEngine to back Ingress and our future games as well as... Full Time · Seattle · Java · noSQL · Cloud Computing        FLIPT Real Estate Marketplace for Home Sellers      Full Stack Web Developer $45k - $65k · 1.0 - 4.0%  FLIPT was launched Fall 2014 and has rapidly grown to hundreds of paid  customers across the US.   We are looking for a startup-minded Full Stack Web Developer / technical co-founder to join our fast moving lean startup team, to help us building... Cofounder · Seattle · Python · Java · jQuery · Data Mining    Inside Sales  $35k - $49k · 0.1 - 0.5%  Salary plus commission  Full Time · Seattle · Business Development · Sales · Sales and Marketing · Telemarketing    Inside Sales Internship $24k - $35k · No equity   Full Time · Seattle · Business Development · Sales · Sales and Marketing     Showing 20 of 164 startups · Create a profile to see them all      Get weekly email alerts for Seattle Startup Jobs              Thanks for signing up. Please click the link in the verification email we just sent.   It looks like you already have an account. Please login to create an alert.      Related searches  Washington  startup jobs   Developer startup jobs in Seattle   Designer startup jobs in Seattle   Product Manager startup jobs in Seattle   Marketing startup jobs in Seattle   Sales startup jobs in Seattle   Bellevue  startup jobs   Seattle, Wa  startup jobs        How it works  1  Create a profile  Sign up for AngelList. (It's 100% free.) Showcase your experience and skills.     2  Find startups  Browse jobs by location, role, market, technology, salary. Click Yes on companies you're interested in.     3  Make a match  Startups get notified when you click Yes. You'll be introduced via email to startups that say Yes to you.          17,488 startups are hiring on AngelList  Create a profile to see them all  Create a profile    Post a job        We're hiring · Help Twitter Facebook · Terms Risks  · Mobile    · Desktop","name":"doc24.json","id":24,"outgoingLinks":109,"title":"Seattle Startup Jobs - AngelList","url":"https://angel.co/seattle/jobs?src=logged-out-home"}